ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_cpu3_ipc_send_regs.xml
		<register id="CPU3TOCPU1INTIPCSENDCOM" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="CPU3TOCPU1INTIPCSENDCOM Register">
			<bitfield id="COMMAND" description="CPU3 to CPU1 IPC Command" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="CPU3TOCPU1INTIPCSENDADDR" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="CPU3TOCPU1INTIPCSENDADDR Register">
			<bitfield id="ADDRESS" description="CPU3 to CPU1 IPC Address" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="CPU3TOCPU1INTIPCSENDDATA" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="CPU3TOCPU1INTIPCSENDDATA Register">
			<bitfield id="DATA" description="CPU3 to CPU1 IPC Data" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="CPU1TOCPU3INTREMOTEREPLY" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="CPU1TOCPU3INTREMOTEREPLY Register">
			<bitfield id="REPLY" description="Refelects the state of CPU1TOCPU3INT IPCREPLY register" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
	</group>
	<group id="CPU3_IPC_SEND_REGS_RegisterFile1" name="CPU3_IPC_SEND_REGS_RegisterFile1" instances="4" offset="0x2000" instaddr="2048">
		<register id="CPU3TOCPU2INTIPCSET" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="CPU3TOCPU2INTIPCSET Register">
			<bitfield id="IPC0" description="Set Remote IPC0 Flag" begin="0" end="0" width="1" rwaccess="RW"/>
			<bitfield id="IPC1" description="Set Remote IPC1 Flag" begin="1" end="1" width="1" rwaccess="RW"/>
			<bitfield id="IPC2" description="Set Remote IPC2 Flag" begin="2" end="2" width="1" rwaccess="RW"/>
			<bitfield id="IPC3" description="Set Remote IPC3 Flag" begin="3" end="3" width="1" rwaccess="RW"/>
			<bitfield id="IPC4" description="Set Remote IPC4 Flag" begin="4" end="4" width="1" rwaccess="RW"/>
			<bitfield id="IPC5" description="Set Remote IPC5 Flag" begin="5" end="5" width="1" rwaccess="RW"/>
			<bitfield id="IPC6" description="Set Remote IPC6 Flag" begin="6" end="6" width="1" rwaccess="RW"/>
			<bitfield id="IPC7" description="Set Remote IPC7 Flag" begin="7" end="7" width="1" rwaccess="RW"/>
			<bitfield id="IPC8" description="Set Remote IPC8 Flag" begin="8" end="8" width="1" rwaccess="RW"/>
			<bitfield id="IPC9" description="Set Remote IPC9 Flag" begin="9" end="9" width="1" rwaccess="RW"/>
			<bitfield id="IPC10" description="Set Remote IPC10 Flag" begin="10" end="10" width="1" rwaccess="RW"/>
			<bitfield id="IPC11" description="Set Remote IPC11 Flag" begin="11" end="11" width="1" rwaccess="RW"/>
			<bitfield id="IPC12" description="Set Remote IPC12 Flag" begin="12" end="12" width="1" rwaccess="RW"/>
			<bitfield id="IPC13" description="Set Remote IPC13 Flag" begin="13" end="13" width="1" rwaccess="RW"/>
			<bitfield id="IPC14" description="Set Remote IPC14 Flag" begin="14" end="14" width="1" rwaccess="RW"/>
			<bitfield id="IPC15" description="Set Remote IPC15 Flag" begin="15" end="15" width="1" rwaccess="RW"/>
			<bitfield id="IPC16" description="Set Remote IPC16 Flag" begin="16" end="16" width="1" rwaccess="RW"/>
			<bitfield id="IPC17" description="Set Remote IPC17 Flag" begin="17" end="17" width="1" rwaccess="RW"/>
			<bitfield id="IPC18" description="Set Remote IPC18 Flag" begin="18" end="18" width="1" rwaccess="RW"/>
			<bitfield id="IPC19" description="Set Remote IPC19 Flag" begin="19" end="19" width="1" rwaccess="RW"/>
			<bitfield id="IPC20" description="Set Remote IPC20 Flag" begin="20" end="20" width="1" rwaccess="RW"/>
			<bitfield id="IPC21" description="Set Remote IPC21 Flag" begin="21" end="21" width="1" rwaccess="RW"/>
			<bitfield id="IPC22" description="Set Remote IPC22 Flag" begin="22" end="22" width="1" rwaccess="RW"/>
			<bitfield id="IPC23" description="Set Remote IPC23 Flag" begin="23" end="23" width="1" rwaccess="RW"/>
			<bitfield id="IPC24" description="Set Remote IPC24 Flag" begin="24" end="24" width="1" rwaccess="RW"/>
			<bitfield id="IPC25" description="Set Remote IPC25 Flag" begin="25" end="25" width="1" rwaccess="RW"/>
			<bitfield id="IPC26" description="Set Remote IPC26 Flag" begin="26" end="26" width="1" rwaccess="RW"/>
			<bitfield id="IPC27" description="Set Remote IPC27 Flag" begin="27" end="27" width="1" rwaccess="RW"/>
			<bitfield id="IPC28" description="Set Remote IPC28 Flag" begin="28" end="28" width="1" rwaccess="RW"/>
			<bitfield id="IPC29" description="Set Remote IPC29 Flag" begin="29" end="29" width="1" rwaccess="RW"/>
			<bitfield id="IPC30" description="Set Remote IPC30 Flag" begin="30" end="30" width="1" rwaccess="RW"/>
			<bitfield id="IPC31" description="Set Remote IPC31 Flag" begin="31" end="31" width="1" rwaccess="RW"/>
		</register>
		<register id="CPU3TOCPU2INTIPCCLR" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="CPU3TOCPU2INTIPCCLR Register">
			<bitfield id="IPC0" description="Clear CPU3TOCPU2IPCFLG.IPC0 Flag" begin="0" end="0" width="1" rwaccess="RW"/>
			<bitfield id="IPC1" description="Clear CPU3TOCPU2IPCFLG.IPC1 Flag" begin="1" end="1" width="1" rwaccess="RW"/>
			<bitfield id="IPC2" description="Clear CPU3TOCPU2IPCFLG.IPC2 Flag" begin="2" end="2" width="1" rwaccess="RW"/>
			<bitfield id="IPC3" description="Clear CPU3TOCPU2IPCFLG.IPC3 Flag" begin="3" end="3" width="1" rwaccess="RW"/>
			<bitfield id="IPC4" description="Clear CPU3TOCPU2IPCFLG.IPC4 Flag" begin="4" end="4" width="1" rwaccess="RW"/>
			<bitfield id="IPC5" description="Clear CPU3TOCPU2IPCFLG.IPC5 Flag" begin="5" end="5" width="1" rwaccess="RW"/>
			<bitfield id="IPC6" description="Clear CPU3TOCPU2IPCFLG.IPC6 Flag" begin="6" end="6" width="1" rwaccess="RW"/>
			<bitfield id="IPC7" description="Clear CPU3TOCPU2IPCFLG.IPC7 Flag" begin="7" end="7" width="1" rwaccess="RW"/>
			<bitfield id="IPC8" description="Clear CPU3TOCPU2IPCFLG.IPC8 Flag" begin="8" end="8" width="1" rwaccess="RW"/>
			<bitfield id="IPC9" description="Clear CPU3TOCPU2IPCFLG.IPC9 Flag" begin="9" end="9" width="1" rwaccess="RW"/>
			<bitfield id="IPC10" description="Clear CPU3TOCPU2IPCFLG.IPC10 Flag" begin="10" end="10" width="1" rwaccess="RW"/>
			<bitfield id="IPC11" description="Clear CPU3TOCPU2IPCFLG.IPC11 Flag" begin="11" end="11" width="1" rwaccess="RW"/>
			<bitfield id="IPC12" description="Clear CPU3TOCPU2IPCFLG.IPC12 Flag" begin="12" end="12" width="1" rwaccess="RW"/>
			<bitfield id="IPC13" description="Clear CPU3TOCPU2IPCFLG.IPC13 Flag" begin="13" end="13" width="1" rwaccess="RW"/>
			<bitfield id="IPC14" description="Clear CPU3TOCPU2IPCFLG.IPC14 Flag" begin="14" end="14" width="1" rwaccess="RW"/>
			<bitfield id="IPC15" description="Clear CPU3TOCPU2IPCFLG.IPC15 Flag" begin="15" end="15" width="1" rwaccess="RW"/>
			<bitfield id="IPC16" description="Clear CPU3TOCPU2IPCFLG.IPC16 Flag" begin="16" end="16" width="1" rwaccess="RW"/>
			<bitfield id="IPC17" description="Clear CPU3TOCPU2IPCFLG.IPC17 Flag" begin="17" end="17" width="1" rwaccess="RW"/>
			<bitfield id="IPC18" description="Clear CPU3TOCPU2IPCFLG.IPC18 Flag" begin="18" end="18" width="1" rwaccess="RW"/>
			<bitfield id="IPC19" description="Clear CPU3TOCPU2IPCFLG.IPC19 Flag" begin="19" end="19" width="1" rwaccess="RW"/>
			<bitfield id="IPC20" description="Clear CPU3TOCPU2IPCFLG.IPC20 Flag" begin="20" end="20" width="1" rwaccess="RW"/>
			<bitfield id="IPC21" description="Clear CPU3TOCPU2IPCFLG.IPC21 Flag" begin="21" end="21" width="1" rwaccess="RW"/>
			<bitfield id="IPC22" description="Clear CPU3TOCPU2IPCFLG.IPC22 Flag" begin="22" end="22" width="1" rwaccess="RW"/>
			<bitfield id="IPC23" description="Clear CPU3TOCPU2IPCFLG.IPC23 Flag" begin="23" end="23" width="1" rwaccess="RW"/>
			<bitfield id="IPC24" description="Clear CPU3TOCPU2IPCFLG.IPC24 Flag" begin="24" end="24" width="1" rwaccess="RW"/>
			<bitfield id="IPC25" description="Clear CPU3TOCPU2IPCFLG.IPC25 Flag" begin="25" end="25" width="1" rwaccess="RW"/>
			<bitfield id="IPC26" description="Clear CPU3TOCPU2IPCFLG.IPC26 Flag" begin="26" end="26" width="1" rwaccess="RW"/>
			<bitfield id="IPC27" description="Clear CPU3TOCPU2IPCFLG.IPC27 Flag" begin="27" end="27" width="1" rwaccess="RW"/>
			<bitfield id="IPC28" description="Clear CPU3TOCPU2IPCFLG.IPC28 Flag" begin="28" end="28" width="1" rwaccess="RW"/>
			<bitfield id="IPC29" description="Clear CPU3TOCPU2IPCFLG.IPC29 Flag" begin="29" end="29" width="1" rwaccess="RW"/>
			<bitfield id="IPC30" description="Clear CPU3TOCPU2IPCFLG.IPC30 Flag" begin="30" end="30" width="1" rwaccess="RW"/>
			<bitfield id="IPC31" description="Clear CPU3TOCPU2IPCFLG.IPC31 Flag" begin="31" end="31" width="1" rwaccess="RW"/>
		</register>
